src/test/resources/mulSoapRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.testcalc.qa.ataccama.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:multiply>
            <val1>10</val1>
            <val2>10</val2>
        </soap:multiply>
    </soapenv:Body>
</soapenv:Envelope>